Revit 2027 API
ComboBox Properties
The ComboBox type exposes the following members.
Properties
Name | Description
Current | Gets or sets the current checked ComboBox member of the ComboBox.
Enabled | Gets or sets a value indicating whether the item is enabled.
(Inherited from RibbonItem)
Image | The image shown on the ComboBox.
ItemText | Gets or sets the text displayed on the item.
(Inherited from RibbonItem)
ItemType | Gets the item type.
(Inherited from RibbonItem)
LongDescription |  Long description of the command tooltip
(Inherited from RibbonItem)
Name | The name of the item.
(Inherited from RibbonItem)
ToolTip | The description that appears as a ToolTip for the item.
(Inherited from RibbonItem)
ToolTipImage | The image to show as a part of the button extended tooltip
(Inherited from RibbonItem)
Visible | Gets or sets a value indicating whether the item is visible.
(Inherited from RibbonItem)
Top
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace